{
    "data": [
        {
            "college-year": "First Year College",
            "school-name": "University of the Assumption",
            "school-year": "2022- 2023",
            "location": "San Fernando, Pampanga",
            "descriptions": [
            "Designed and architected a mockup redesign of the University of the Assumption website using Figma as my primary design tool.",
            "Collaborated with other students to develop a Pacman theme quiz game for our midterm requirement on one of our programming subject using Python and Kivy as our primary language.",
            "Developed an IoT security device that detects a motion, captures an image and sends it to your personal email using Python and other Python libraries.",
            "Used Codechum to actively learn and explore Python syntax and different coding practices."
            ]
        },
        {
            "college-year": "Second Year College",
            "school-name": "University of the Assumption",
            "school-year": "2023 - 2024",
            "location": "San Fernando, Pampanga",
            "descriptions": [
            "Transitioned from Python to Java and developed basic systems such as calculating the minimum fare of a tricycle based on the destination kilometers from point A to point B.",
            "Learned how to developed a database and how to query using MySQL and XAMPP.",
            "Transitioned from Java to Web Development with HTML, CSS and JavaScript.",
            "Passed on Information Technology Specialist Databases exam."
            ]
        },
        {
            "college-year": "Third Year College",
            "school-name": "University of the Assumption",
            "school-year": "2024 - current",
            "location": "San Fernando, Pampanga",
            "descriptions": [
            "Developed my own portfolio website as my prelim examination requirement for Mobile and Web Development subject and used HTML, CSS and JavaScript as my primary tools and language.",
            "Actively learning on my Free Elective subject to follow best practices and optimize my code in terms of load times and code formatting.",
            "Utilized Bootstrap on Mobile and Web Development subject to enhance and reduce the lines of code on my CSS stylesheet.",
            "Transitioned from normal vanilla JavaScript into it's frameworks and libraries such as NEXT.js and React.js."
            ]
        }
    ]
}















